package by.htp.task.cycles;

/* напишите программу где пользователь вводит любое целое положительное
 * число, а программа суммирует все числа от 1 до введенного пользователем числа
 * 
 * 
 */

public class Task6 {
	
	public static void main(String[] args) {
		int j,s;
		j = 20;// число пользователя
		s = 0;
		for (int i = 1; i <= j; i++) {
			s = s +i; 
		}
			System.out.println("сумма = "+s);
			
		
		
	}
	

}
