package by.htp.task.branching;
/*
 * 
 * составьте программу сравнения двух чисел 1 и 2 если 1 меньше 2 - вывести на 
 * экран цифру 7, а в противном случае цифру 8
 */

public class Task1 {
	public static void main(String[] args) {
		
		int a,b;
		a = 11;
		b = 9;
		if (a < b) {
			System.out.println("7");
			
		}
		else {
			System.out.println("8");
		}
	}

}
