package by.htp.task.branching;
/*
 *составить программу сравнения введенного числа а и цифры 3 . 
 *вывести на экран слово yes если число а меньше
 *если больше то вывести слово no  
 * 
 */

public class Task3 {

	public static void main(String[] args) {
		int a = 7;
		if (a < 3) {
			System.out.println("yes");
					
		}
		else {
			System.out.println("no");
		}
	}
}
