package by.htp.task.branching;
/*
 * 
 * составить программу сравнения двух чисел 1 и 2
 * если 1 меньше 2 вывести на экран слово yes
 * в противном случае слово no
 */

public class Task2 {

	
	public static void main(String[] args) {
		
		int a,b;
		a = 5;
		b = 2;
		if (a < b) {
			System.out.println("yes");
	
		}
		else {
			System.out.println("no");
		}
	}
}
